Revit 2027 API
SynchronizeWithCentralOptions.Comment Property
 User description of changes made since the last Sync with Central. Empty by default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Comment { get; set; }
Public Property Comment As String
	Get
	Set
public:
property String^ Comment {
	String^ get ();
	void set (String^ value);
}
member Comment : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: comment has more than 30,000 characters.
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace